app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("created_at", "date", "remarks", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-27 17:55:13.920896"], ["date", "2014-09-27 00:00:00.000000"], ["remarks", "Training"], ["updated_at", "2014-09-27 17:55:13.920896"]]