app/controllers/baseactivities_controller.rb

SELECT "activities".* FROM "activities"  WHERE "activities"."type" IN ('Baseactivity')
---
  def index
    @baseactivities = Baseactivity.all