app/controllers/exercises_controller.rb

  def create
    @exercise = Exercise.new(exercise_params)

    respond_to do |format|
      if @exercise.save
---
INSERT INTO "exercises" ("created_at", "entity", "repetitions", "summary", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-30 17:53:10.982052"], ["entity", "1 crunch"], ["repetitions", 20], ["summary", "Crunches"], ["updated_at", "2014-09-30 17:53:10.982052"]]

  def update
    respond_to do |format|
      if @exercise.update(exercise_params)
---
UPDATE "exercises" SET "entity" = ?, "updated_at" = ? WHERE "exercises"."id" = 1  [["entity", "1 up, 1 down"], ["updated_at", "2014-09-30 17:53:26.783169"]]

    def set_exercise
      @exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises"  WHERE "exercises"."id" = ? LIMIT 1  [["id", 1]]